EvgeniyGA/gas-lighter-fw/targets/stm32f7/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define led_mode0_Pin GPIO_PIN_3
#define led_mode0_GPIO_Port GPIOE
#define led_mode1_Pin GPIO_PIN_4
#define led_mode1_GPIO_Port GPIOE
#define led_mode2_Pin GPIO_PIN_5
#define led_mode2_GPIO_Port GPIOE
#define led_mode3_Pin GPIO_PIN_6
#define led_mode3_GPIO_Port GPIOE
#define led_mode4_Pin GPIO_PIN_14
#define led_mode4_GPIO_Port GPIOC
#define led_mode5_Pin GPIO_PIN_15
#define led_mode5_GPIO_Port GPIOC
#define btn_go_Pin GPIO_PIN_3
#define btn_go_GPIO_Port GPIOD
#define CS_Pin GPIO_PIN_6
#define CS_GPIO_Port GPIOD
#define btn_mode_Pin GPIO_PIN_9
#define btn_mode_GPIO_Port GPIOB
#define led_go_Pin GPIO_PIN_0
#define led_go_GPIO_Port GPIOE
#define led_status_Pin GPIO_PIN_1
#define led_status_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
